/* automatically generated by rust-bindgen 0.60.1 */

pub const ClientAPI_GRPC_DIRECTPATH: ClientAPI = 0;
pub const ClientAPI_GRPC_NO_DIRECTPATH: ClientAPI = 1;
pub const ClientAPI_JSON: ClientAPI = 2;
pub type ClientAPI = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GoogleStorageClient {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CallResult {
    pub success: bool,
    pub bytes_received: ::std::os::raw::c_ulong,
    pub error_code: [::std::os::raw::c_char; 25usize],
    pub upload_id: [::std::os::raw::c_char; 256usize],
}
#[test]
fn bindgen_test_layout_CallResult() {
    assert_eq!(
        ::std::mem::size_of::<CallResult>(),
        304usize,
        concat!("Size of: ", stringify!(CallResult))
    );
    assert_eq!(
        ::std::mem::align_of::<CallResult>(),
        8usize,
        concat!("Alignment of ", stringify!(CallResult))
    );
    fn test_field_success() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<CallResult>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).success) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(CallResult),
                "::",
                stringify!(success)
            )
        );
    }
    test_field_success();
    fn test_field_bytes_received() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<CallResult>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).bytes_received) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(CallResult),
                "::",
                stringify!(bytes_received)
            )
        );
    }
    test_field_bytes_received();
    fn test_field_error_code() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<CallResult>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).error_code) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(CallResult),
                "::",
                stringify!(error_code)
            )
        );
    }
    test_field_error_code();
    fn test_field_upload_id() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<CallResult>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).upload_id) as usize - ptr as usize
            },
            41usize,
            concat!(
                "Offset of field: ",
                stringify!(CallResult),
                "::",
                stringify!(upload_id)
            )
        );
    }
    test_field_upload_id();
}
extern "C" {
    pub fn CreateGCSClient(
        client_api: ClientAPI,
        project: *const ::std::os::raw::c_char,
    ) -> *mut GoogleStorageClient;
}
extern "C" {
    pub fn DestroyGCSClient(client: *mut GoogleStorageClient);
}
extern "C" {
    pub fn ReadObject(
        client: *mut GoogleStorageClient,
        bucket: *const ::std::os::raw::c_char,
        obj: *const ::std::os::raw::c_char,
    ) -> CallResult;
}
extern "C" {
    pub fn StartResumableWrite(
        client: *mut GoogleStorageClient,
        bucket: *const ::std::os::raw::c_char,
        obj: *const ::std::os::raw::c_char,
    ) -> CallResult;
}
extern "C" {
    pub fn QueryWriteStatus(
        client: *mut GoogleStorageClient,
        upload_id: *const ::std::os::raw::c_char,
    ) -> CallResult;
}
extern "C" {
    pub fn DeleteWrite(
        client: *mut GoogleStorageClient,
        upload_id: *const ::std::os::raw::c_char,
    ) -> CallResult;
}
